(function(){
  const adjectives = [
    "爆走","疾風","超加速","無敵","激烈","最速","豪快","鋼鉄","天空","雷光",
    "烈火","炎帝","突撃","暴走","機敏","電撃","稲妻","竜巻","嵐","旋風",
    "暴風","銀河","闘神","爆烈","覇王","白虎","黒豹","紅蓮","蒼穹","蒼天",
    "夜叉","鬼神","魔王","英雄","勇者","大天使","極光","超絶","爆轟","閃光",
    "迅雷","勇猛","剛力","重力","高速","極限","究極","超電","闘魂","弾丸",
    "爆音","疾走","百獣","豪腕","鉄壁","蒼炎","白銀","蒼雷","爆炎","疾雷",
    "闘龍","迅速","蒼狼","赤影","黒炎","烈風","妖精","神速","雷鳴","飛翔",
    "龍神","業火","氷結","覚醒","闘志","炎獄","閃撃","爆裂","疾飛","飛電",
    "双刃","疾風怒濤","高速旋回","全力","爆炎突進","電光石火","四面楚歌","捲土重来","豪速","烈火爆走",
    "超電加速","神烈","百式","永久","新星","疾光","不死鳥","黄金","銀色","鉄拳"
  ];
  const nouns = [
    "ワニ","ゴリラ","サイ","ドラゴン","トラ","ゾウ","タカ","オオカミ","サメ","ライオン",
    "パンダ","クマ","ブタ","カメ","キリン","ヒョウ","ウサギ","リス","モモンガ","ラッコ",
    "イタチ","カバ","ハリネズミ","ヘビ","コアラ","アルマジロ","フクロウ","カラス","ペンギン","シカ",
    "サル","コンドル","チーター","アルパカ","ダチョウ","ラクダ","ハヤブサ","カモシカ","イノシシ","ヤマアラシ",
    "ムササビ","クジャク","カエル","イーグル","フクロモモンガ","タイガー","ドラゴンフライ","ワシ","サソリ","カニ",
    "ヤドカリ","カジキ","シャチ","イルカ","マンタ","ウミガメ","タツノオトシゴ","クラゲ","ヒトデ","カレイ",
    "アザラシ","セイウチ","トド","ホッキョクグマ","ホッキョクギツネ","オオトカゲ","コブラ","チョウ","アリ","ハチ",
    "セミ","ムカデ","カマキリ","トンボ","バッタ","テントウムシ","カブトムシ","クワガタ","ダンゴムシ","ミジンコ",
    "プテラノドン","ティラノサウルス","トリケラトプス","ステゴサウルス","アパトサウルス","ブロントサウルス","アンキロサウルス","ディメトロドン","ベロキラプトル","モササウルス",
    "ネコ","イヌ","カワウソ","ヤギ","ヒツジ","ウマ","ウシ","ニワトリ","ウズラ","スズメ"
  ];
  const titles = [
    "キング","将軍","覇者","勇者","騎士","皇帝","司令官","王子","伯爵","公爵",
    "男爵","大佐","提督","隊長","団長","忍者","侍","武者","船長","総督",
    "大王","元帥","師範","覇王","魔王","神","将","博士","大統領","総理",
    "教授","マスター","チャンピオン","ファイター","リーダー","ボス","首領","参謀","議長","女王",
    "守護者","伝説","精霊","巨匠","怪物","英雄","艦長","軍神","大魔導士","征服者",
    "支配者","指揮官","エース","皇子","公主","神官","将士","統領","革命家","操縦士",
    "総長","副官","参謀長","勇将","王者","聖騎士","大賢者","闘士","特攻隊長","魔導士",
    "策士","支配神","征伐者","革命王","主宰","凶王","闇王","光王","帝王","女帝",
    "王妃","隊士","船員","門番","参事","近衛","錬金術師","魔術師","剣豪","豪傑",
    "長老","部長","局長","総監","巨獣","双璧","闘神","守護神","頂点","覇神"
  ];
  window.nameDataA = { adjectives, nouns, titles };
})();
